{
  "term": "address",
  "termid": "1698",
  "eng": {
    "dates": [
      {
        "date": "2015-12-15 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "structured information that allows the unambiguous determination of an object for purposes of identification and location"
      }
    ],
    "examples": [
      {
        "content": "Address where the object is a business: 611 Fifth Avenue, New York NY 10022."
      },
      {
        "content": "Address where the object is a building: Lombardy House, 809 Lombardy Street, The Hills, 0039, South Africa."
      },
      {
        "content": "Address where the object is a land parcel for a building: San 4–5, Munjae-ro, Songpa-gu, Seoul, 13144, South Korea."
      },
      {
        "content": "Address where the object is a building group, such as a school or large apartment area: 228-dong 404-ho, 26 Kyunghee-daero, Dongdaemun-gu, Seoul 130–701, South Korea."
      }
    ],
    "id": "1698",
    "notes": [
      {
        "content": "The object is identifiable in the real world, i.e. electronic and virtual addresses are excluded."
      },
      {
        "content": "“Identification” refers to the fact that the structured information in the address unambiguously determines the object, i.e. it helps the human to identify the object. In other words, “identification” here does not refer to unique identifiers in a database or dataset."
      },
      {
        "content": "There can be many addresses for an object, but at any moment (or lifecycle stage), an address unambiguously determines a single object (see ISO 19160-1:2015, Annex D for examples)."
      },
      {
        "content": "Two addresses from two different address classes (i.e. they have different sets of components) for the same addressable object are two different addresses (refer to ISO 19160-1:2015, Annex E for more examples)."
      },
      {
        "content": "Two addresses for the same addressable object and from the same address class, but in two different languages are two different addresses (refer to ISO 19160-1:2015, Annex E for more examples)."
      },
      {
        "content": "In addition to the addressable object, there may be a multitude of people, organizations, addressees or other objects associated with an address. These are external to the address model (refer to ISO 19160-1:2015, Annex C and Annex F for examples)."
      }
    ],
    "release": 4.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19160-1:2015",
          "clause": "4.1",
          "link": "https://www.iso.org/standard/61710.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "address"
      }
    ],
    "language_code": "eng",
    "entry_status": "valid",
    "review_date": "2012-02-27 00:00:00 +0500",
    "review_decision_date": "2015-12-15 00:00:00 +0500",
    "review_decision_event": "Normal ISO processing",
    "status": "valid"
  },
  "ara": null,
  "dan": null,
  "deu": null,
  "fin": null,
  "fra": null,
  "jpn": null,
  "kor": null,
  "msa": null,
  "nld": null,
  "pol": null,
  "rus": null,
  "spa": {
    "dates": [
      {
        "date": "2015-12-15 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "información estructurada que permite la determinación inequívoca de un objeto para fines de identificación y localización"
      }
    ],
    "examples": [
      {
        "content": "EJEMPLO Dirección en la que el objeto es un negocio. 611 Fifth Avenue, New York NY 10022."
      },
      {
        "content": "EJEMPLO 2 Dirección en la que el objeto es un edificio: Lombardy House, 809 Lombardy Street, The Hills, 0039, Sudáfrica."
      },
      {
        "content": "EJEMPLO 3 Dirección donde el objeto es una parcela de terreno de un edificio: San 4-5, Munjae-ro, Songpa-gu, Seúl, 13144, Corea del Sur."
      },
      {
        "content": "EJEMPLO 4 Dirección donde el objeto es una agrupación de edificios, como un colegio o una zona amplia de apartamentos: 228-dong 404-ho, 26 Kyunghee-daero, Dongdaemun-gu, Seoul 130–701, South Korea."
      }
    ],
    "id": "1698",
    "notes": [
      {
        "content": "El objeto es identificable en el mundo real, es decir, las direcciones electrónicas y virtuales están excluidas."
      },
      {
        "content": "\"Identificación\" se refiere al hecho de que la información estructurada en la dirección determina  inequívocamente el objeto, es decir, ayuda a los humanos a identificar el objeto. En otras palabras, \"identificación\" aquí no hace referencia a los identificadores únicos en una base de datos o en un conjunto de datos."
      },
      {
        "content": "Puede haber muchas direcciones para un objeto, pero en cualquier momento (o etapa del ciclo de vida), una dirección determina inequívocamente un único objeto (para más ejemplos, véase la Norma ISO 19160-1:2015. Anexo D)."
      },
      {
        "content": "Dos direcciones de dos clases de dirección diferente (es decir, tienen diferente conjunto de componentes) para el mismo objeto direccionable son dos direcciones diferentes (para más ejemplos, véase Norma ISO 19160-1:2015, Anexo E)"
      },
      {
        "content": "Dos direcciones para el mismo objeto direccionable y de la misma clase de dirección, pero en dos idiomas diferentes, son dos direcciones diferentes (para más ejemplos, véase la Norma ISO 19160-1: 2015, Anexo E)"
      },
      {
        "content": "Además del objeto direccionable, puede haber multitud de personas organizaciones, direcciones u otros objetos asociados con una dirección. Estos son externos al modelo de direcciones (para más ejemplos, véase la Norma ISO 19160-1:2015, Anexo C)."
      }
    ],
    "release": 4.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19160-1:2015",
          "clause": "4.1",
          "link": "https://www.iso.org/standard/61710.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "dirección"
      }
    ],
    "language_code": "spa",
    "entry_status": "valid",
    "review_date": "2012-02-27 00:00:00 +0500",
    "review_decision_date": "2015-12-15 00:00:00 +0500",
    "review_decision_event": "Normal ISO processing",
    "status": "valid"
  },
  "swe": null,
  "zho": null
}