{
  "term": "breakline",
  "termid": "1932",
  "eng": {
    "dates": [
      {
        "date": "2016-04-15 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "linear feature that describes a change in the smoothness or continuity of a surface"
      }
    ],
    "examples": [

    ],
    "id": "1932",
    "notes": [
      {
        "content": "A soft breakline ensures that known z-values along a linear feature are maintained (for example, elevations along a pipeline, road centreline or drainage ditch), and ensures that linear features and polygon edges are maintained in a Triangulated Irregular Network (TIN) surface model, by enforcing the breaklines as TIN edges. They are generally synonymous with 3-D breaklines because they are depicted with series of x/y/z coordinates. Somewhat rounded ridges or the trough of a drain may be collected using soft breaklines."
      },
      {
        "content": "A hard breakline defines interruptions in surface smoothness, for example, to define streams, shorelines, dams, ridges, building footprints, and other locations with abrupt surface changes."
      }
    ],
    "release": 4.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO/TS 19159-2:2016",
          "clause": "4.5",
          "link": "https://www.iso.org/standard/64768.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "breakline"
      }
    ],
    "language_code": "eng",
    "entry_status": "valid",
    "review_date": "2014-08-26 00:00:00 +0500",
    "review_decision_date": "2016-04-15 00:00:00 +0500",
    "review_decision_event": "Normal ISO processing",
    "status": "valid"
  },
  "ara": null,
  "dan": null,
  "deu": null,
  "fin": null,
  "fra": null,
  "jpn": null,
  "kor": null,
  "msa": null,
  "nld": null,
  "pol": null,
  "rus": null,
  "spa": {
    "dates": [
      {
        "date": "2016-04-15 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "objeto geográfico lineal que describe un cambio en la suavidad o continuidad de una superficie"
      }
    ],
    "examples": [

    ],
    "id": "1932",
    "notes": [
      {
        "content": "Una línea de quiebre suave garantiza que sobre un objeto geografíco lineal se mantengan los valores conocidos de z (por ejemplo, elevaciones a lo largo de una tubería, el eje de una carretera o una acequia de drenaje), y asegura que los objetos geográficos lineales y los bordes de los polígonos se mantengan en un modelo de superficie de Red Irregular de Triángulos (TIN), por medio de forzar las lineas de quiebre como bordes del TIN. En general, son sinónimo de las líneas de quiebre tridimensionales porque se representan con series de coordenadas x/y/z. De cierto modo, las crestas redondeadas o las depresiones de drenaje se pueden capturar utilizando lineas de quiebre suaves."
      },
      {
        "content": "Una línea de quiebre fuerte define interrupciones enla suavidad de la superficie por ejemplo, para definir cauces, líneas de costa, represas, crestas, plantas de edificios y otras ubicaciones con cambios abruptos en la superficie."
      }
    ],
    "release": 4.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO/TS 19159-2:2016",
          "clause": "4.5",
          "link": "https://www.iso.org/standard/64768.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "línea de quiebre"
      }
    ],
    "language_code": "spa",
    "entry_status": "valid",
    "review_date": "2014-08-26 00:00:00 +0500",
    "review_decision_date": "2016-04-15 00:00:00 +0500",
    "review_decision_event": "Normal ISO processing",
    "status": "valid"
  },
  "swe": null,
  "zho": null
}