{
  "term": "transfer node",
  "termid": "2104",
  "eng": {
    "dates": [
      {
        "date": "2015-06-15 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "location that facilitates transfers between transport modes, transport networks and/or transport means"
      }
    ],
    "examples": [

    ],
    "id": "2104",
    "notes": [
      {
        "content": "A transfer node may contain other transfer nodes and may be related to one or more transport modes and transport networks. It may also contain stop points and facilities for the users of the transfer node. A transfer node may host services that are provided to the users of the transfer node, e.g. information services, ticket sales, etc."
      },
      {
        "content": "A transfer node may be a part of a hierarchy of transfer nodes. Thus, a transfer node may be related to many transport modes and transport networks. However, only transfer nodes that are related to just one transport network will have stop points."
      },
      {
        "content": "The stop points related to different transfer nodes, which may serve different transport modes and networks, may, in real life, have the same physical locations. A tram and a bus may for example share the same platform, but conceptually they may belong to different transfer nodes."
      }
    ],
    "release": 4.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19147:2015",
          "clause": "3.15",
          "link": "https://www.iso.org/standard/44874.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "transfer node"
      }
    ],
    "language_code": "eng",
    "entry_status": "valid",
    "review_date": "2009-06-20 00:00:00 +0600",
    "review_decision_date": "2015-06-15 00:00:00 +0500",
    "review_decision_event": "Normal ISO processing",
    "status": "valid"
  },
  "ara": null,
  "dan": null,
  "deu": null,
  "fin": null,
  "fra": null,
  "jpn": null,
  "kor": null,
  "msa": null,
  "nld": null,
  "pol": null,
  "rus": null,
  "spa": {
    "dates": [
      {
        "date": "2015-06-15 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "localización que facilita el transbordo entre modos de transporte, redes de transporte y/o medios de transporte"
      }
    ],
    "examples": [

    ],
    "id": "2104",
    "notes": [
      {
        "content": "Un nodo de transbordo puede contener otros nodos de transbordo y puede estar relacionado con uno o más modos y redes de transporte. También puede contener punto de parada e instalaciones para los usuarios del nodo de conexión. Un nodo de conexión puede alojar servicios que se proporcionan para los usuarios, por ejemplo, servicios de información, venta de boletos, etc."
      },
      {
        "content": "Un nodo de transbordo puede ser parte de una jerarquía de nodos de conexión. Por lo tanto, un nodo de transbordo puede estar relacionado con muchos modos y redes de transporte. Sin embargo, solo los nodos de transbordo  que estén relacionados con una sola red de transporte tendrán puntos de parada."
      },
      {
        "content": "Las paradas relacionadas con diferentes nodos de transbordo que pueden servir a diferentes modos y redes de transporte, pueden tener, en la vida real, una misma localización física. Un tranvía y un autobús pueden, por ejemplo, compartir el mismo andén, pero conceptualmente pueden pertenecer a diferentes nodos de transbordo."
      }
    ],
    "release": 4.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19147:2015",
          "clause": "3.15",
          "link": "https://www.iso.org/standard/44874.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "nodo de transbordo"
      }
    ],
    "language_code": "spa",
    "entry_status": "valid",
    "review_date": "2009-06-20 00:00:00 +0600",
    "review_decision_date": "2015-06-15 00:00:00 +0500",
    "review_decision_event": "Normal ISO processing",
    "status": "valid"
  },
  "swe": null,
  "zho": null
}