{
  "term": "addressee",
  "termid": "2112",
  "eng": {
    "dates": [
      {
        "date": "2017-11-15 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "party who is the ultimate recipient of a delivery item or service"
      }
    ],
    "examples": [

    ],
    "id": "2112",
    "notes": [
      {
        "content": "The addressee may be explicitly defined as part of the postal address, or may be implicit. For example, in certain countries, omission of addressee information is taken as implying that delivery is to be to an individual or legal entity having legal access to the delivery point."
      },
      {
        "content": "Mr. or Mrs. Smith specifies that the addressee is either of two individuals, while Mr. Jones and Mrs. Smith denote that the addressee is a group of two individuals. See also role descriptor."
      },
      {
        "content": "The use made by the postal operator of addressee and mailee data might be dependent on the postal service applicable to the postal item. For some services, such as registered mail, the postal operator’s responsibility might include ensuring that the addressee or a duly authorized representative acknowledges receipt of the postal item. In other cases, addressee data could be purely informative or used by the postal operator only for consistency checking and/or for the activation of forwarding services. In other cases, it might be used for sorting or sequencing purposes prior to delivery, e.g. in the case of business mail being pre-sequenced by department or individual company official."
      },
      {
        "content": "In some countries, the addressee may be an abstraction such as “postal customer”."
      }
    ],
    "release": 5.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19160-4:2023",
          "clause": "3.3",
          "link": "https://www.iso.org/standard/83470.html"
        },
        "type": "authoritative"
      },
      {
        "origin": {
          "ref": "ISO 19160-4:2017"
        },
        "type": "lineage",
        "status": "unspecified"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "addressee"
      }
    ],
    "language_code": "eng",
    "entry_status": "valid",
    "review_date": "2023-04-12 00:00:00 +0500",
    "review_decision_date": "2023-04-12 00:00:00 +0500",
    "review_decision_event": "Publication of ISO 19160-4:2023(E)",
    "status": "valid"
  },
  "ara": null,
  "dan": null,
  "deu": null,
  "fin": null,
  "fra": null,
  "jpn": null,
  "kor": null,
  "msa": null,
  "nld": null,
  "pol": null,
  "rus": null,
  "spa": {
    "dates": [
      {
        "date": "2017-11-15 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "parte designada como receptor final de la entrega de un artículo o servicio"
      }
    ],
    "examples": [

    ],
    "id": "2112",
    "notes": [
      {
        "content": "NOTA 1: El destinatario se puede definir explícitamente como parte de la dirección postal o puede estar implícito. Por ejemplo, en ciertos países, la omisión de información sobre el destinatario se considera que implica que la entrega se hará a una persona física o jurídica que tenga acceso legal al punto de entrega."
      },
      {
        "content": "NOTA 2: El Sr. o la Sra. Smith especifica que el destinatario es uno de los dos individuos, mientras que el Sr. Jones y la Sra. Smith denotan que el destinatario es un grupo de dos individuos. Véase también el rol descriptor."
      },
      {
        "content": "NOTA 3: El uso que haga el operador postal de los datos del destinatario y del destino podría depender del servicio postal aplicable al ítem postal. En el caso de algunos servicios, como el correo certificado, la responsabilidad del operador postal podría incluir la garantía de que el destinatario o un representante debidamente autorizado acuse recibo del ítem postal. En otros casos, los datos del destinatario podrían ser puramente informativos o ser utilizados por el operador postal únicamente para la comprobación de la coherencia y/o para la activación de los servicios de reenvío. En otros casos, podrían utilizarse con fines de clasificación o ordenación antes de la entrega, por ejemplo, en el caso de que el correo comercial sea objeto de una ordenación previa por parte de un funcionario de un departamento o de una empresa individual."
      },
      {
        "content": "NOTA 4: En algunos países, el destinatario puede ser una abstracción de \"cliente postal\"."
      }
    ],
    "release": 5.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19160-4:2023",
          "clause": "3.3",
          "link": "https://www.iso.org/standard/83470.html"
        },
        "type": "authoritative"
      },
      {
        "origin": {
          "ref": "ISO 19160-4:2017"
        },
        "type": "lineage",
        "status": "unspecified"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "destinatario"
      }
    ],
    "language_code": "spa",
    "entry_status": "valid",
    "review_date": "2023-04-12 00:00:00 +0500",
    "review_decision_date": "2023-04-12 00:00:00 +0500",
    "review_decision_event": "Publication of ISO 19160-4:2023(E)",
    "status": "valid"
  },
  "swe": null,
  "zho": null
}