{
  "term": "empty set <mathematics>",
  "termid": "2158",
  "eng": {
    "dates": [
      {
        "date": "2019-12-02 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "set without any elements"
      }
    ],
    "examples": [

    ],
    "id": "2158",
    "notes": [
      {
        "content": "Sets are equal if they contain exactly the same elements. Since any two empty sets would share exactly the same contained elements (by definition none), they are, by definition, equal. The empty set (<math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mi>&#x2205;</mi>  </mstyle></math>) can be considered a geometric entity, because all the elements it contains are points. This is a vacuous statement since the set <math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mi>&#x2205;</mi>  </mstyle></math> contains no elements, and therefore the \"for all\" statement has nothing to test and is thus true in each of its non-existent cases. There are a lot of true but vacuous statements in proofs about <math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mi>&#x2205;</mi>  </mstyle></math>. This confuses some programmers since many systems use type safe sets, in which the class of the entities determines a class for the container set. The math does not care about \"class\" and only sees sets; so that an empty set of aardvarks and an empty set of zebras in mathematics are (is?) the same set. The other confusion is that <math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mi>&#x2205;</mi>  </mstyle></math> is not the database Null introduced by Codd and used in relational and other query languages in 3 valued logic. Null means unknown and many statements involving Null are undecidable (neither provably true nor provably false). The empty set is not \"lack of knowledge\" but certainty in the nonexistence of elements in the set. Most statements beginning \"for all elements in <math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mi>&#x2205;</mi>  </mstyle></math>\" are true, but vacuous. Most statements beginning \"there exist an element in <math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mi>&#x2205;</mi>  </mstyle></math>\" are always categorically false. It is almost impossible to construct an undecidable statement about <math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mi>&#x2205;</mi>  </mstyle></math>. Null and <math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mi>&#x2205;</mi>  </mstyle></math> are not related. \"Void\" can mean \"invalid\" or \"completely empty.\""
      }
    ],
    "release": 5.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2019",
          "clause": "3.32",
          "link": "https://www.iso.org/standard/66175.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "empty set <mathematics>"
      },
      {
        "type": "abbreviation",
        "designation": "∅"
      }
    ],
    "language_code": "eng",
    "entry_status": "valid",
    "review_date": "2019-12-02 00:00:00 +0500",
    "review_decision_date": "2019-12-02 00:00:00 +0500",
    "review_decision_event": "Normal ISO processing",
    "status": "valid"
  },
  "ara": null,
  "dan": null,
  "deu": null,
  "fin": null,
  "fra": null,
  "jpn": null,
  "kor": null,
  "msa": null,
  "nld": null,
  "pol": null,
  "rus": null,
  "spa": {
    "dates": [
      {
        "date": "2019-12-02 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "conjunto sin ningún elemento"
      }
    ],
    "examples": [

    ],
    "id": "2158",
    "notes": [
      {
        "content": "NOTA1: Los conjuntos son iguales si contienen exactamente los mismos elementos. Dado que dos conjuntos vacíos cualesquiera compartirían exactamente los mismos elementos contenidos (por definición ninguno), son, por definición, iguales. El conjunto vacío (∅) puede considerarse una entidad geométrica, porque todos los elementos que contiene son puntos. Se trata de una afirmación vacía, ya que el conjunto ∅ no contiene ningún elemento y, por lo tanto, la afirmación \"para todos\" no tiene nada que probar y, por lo tanto, es verdadera en cada uno de sus casos inexistentes.  Hay muchas declaraciones verdaderas pero vacías en las pruebas sobre ∅. Esto confunde a algunos programadores, ya que muchos sistemas utilizan conjuntos de tipo seguro, en los que la clase de las entidades determina una clase para el conjunto contenedor. A las matemáticas no les importa la \"clase\" y sólo ven conjuntos; así que un conjunto vacío de aardvarks y un conjunto vacío de cebras en matemáticas son (¿es?) el mismo conjunto. La otra confusión es que ∅ no es el Null de la base de datos introducida por Codd y utilizada en lenguajes relacionales y otros lenguajes de consulta en la lógica trivalente. Null significa desconocido y muchas afirmaciones que involucran a Null son indecidibles (no se puede probar que sean verdaderas ni falsas). El conjunto vacío no es \"falta de conocimiento\" sino certeza en la inexistencia de elementos en el conjunto.  La mayoría de las declaraciones que comienzan con \"para todos los elementos en ∅\" son verdaderas, pero vacías. La mayoría de las declaraciones que comienzan con \"existe un elemento en ∅\" son siempre categóricamente falsas. Es casi imposible construir una declaración indecidible sobre ∅. Null y ∅ no están relacionados. \"Void\" puede significar \"inválido\" o \"completamente vacío\"."
      }
    ],
    "release": 5.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2019",
          "clause": "3.32",
          "link": "https://www.iso.org/standard/66175.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "conjunto vacío <matemáticas>"
      },
      {
        "type": "abbreviation",
        "designation": "∅"
      }
    ],
    "language_code": "spa",
    "entry_status": "valid",
    "review_date": "2019-12-02 00:00:00 +0500",
    "review_decision_date": "2019-12-02 00:00:00 +0500",
    "review_decision_event": "Procedimiento normal de ISO",
    "status": "valid"
  },
  "swe": null,
  "zho": null
}