{
  "term": "geometric primitive <geometry>",
  "termid": "2164",
  "eng": {
    "dates": [
      {
        "date": "2019-12-02 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "geometric object representing a single, connected, homogeneous (isotropic) element of space"
      }
    ],
    "examples": [

    ],
    "id": "2164",
    "notes": [
      {
        "content": "Geometric primitives are non-decomposed objects that present information about geometric configuration. They include points, curves, surfaces, and solids. Many geometric objects behave like primitives (supporting the same interfaces defined for geometric primitives) but are actually composites composed of some number of other primitives. General collections may be aggregates and incapable of acting like a primitive (such as the lines of a complex network, which is not connected and thus incapable of being traceable as a single line). By this definition, a geometric primitive is topological open, since the boundary points are not isotropic to the interior points. Geometry is assumed to be closed. For points, the boundary is empty."
      }
    ],
    "release": 5.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2019",
          "clause": "3.50",
          "link": "https://www.iso.org/standard/66175.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "geometric primitive <geometry>"
      }
    ],
    "language_code": "eng",
    "entry_status": "valid",
    "review_date": "2019-12-02 00:00:00 +0500",
    "review_decision_date": "2019-12-02 00:00:00 +0500",
    "review_decision_event": "Publication of document ISO 19107:2019(E)",
    "status": "valid"
  },
  "ara": null,
  "dan": null,
  "deu": null,
  "fin": null,
  "fra": null,
  "jpn": null,
  "kor": null,
  "msa": null,
  "nld": null,
  "pol": null,
  "rus": null,
  "spa": {
    "dates": [
      {
        "date": "2019-12-02 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "objeto geométrico que representa un elemento único, conectado y homogéneo (isotrópico) del espacio"
      }
    ],
    "examples": [

    ],
    "id": "2164",
    "notes": [
      {
        "content": "Las primitivas geométricas son objetos no descompuestos que presentan información sobre la configuración geométrica. Incluyen puntos, curvas, superficies y sólidos. Muchos objetos geométricos se comportan como primitivas (soportando las mismas interfaces definidas para las primitivas geométricas) pero en realidad están compuestos por un número de primitivas. Las colecciones generales pueden ser agregadas e incapaces de actuar como una primitiva (como las líneas de una red compleja, que no está conectada y por lo tanto es incapaz de trazarse como una sola línea). Por esta definición, una primitiva geométrica es abierta topológicamente, ya que los puntos frontera no son isotrópicos a los puntos interiores. Se supone que la geometría está cerrada. Para los puntos, la frontera está vacía."
      }
    ],
    "release": 5.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2019",
          "clause": "3.50",
          "link": "https://www.iso.org/standard/66175.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "primitiva geométrica <geometría>"
      }
    ],
    "language_code": "spa",
    "entry_status": "valid",
    "review_date": "2019-12-02 00:00:00 +0500",
    "review_decision_date": "2019-12-02 00:00:00 +0500",
    "review_decision_event": "Publicación de documento ISO 19107:2019(E)",
    "status": "valid"
  },
  "swe": null,
  "zho": null
}