{
  "term": "bearing",
  "termid": "2238",
  "eng": {
    "dates": [
      {
        "date": "2019-12-02 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "horizontal angle, tangent or direction at a point"
      }
    ],
    "examples": [

    ],
    "id": "2238",
    "notes": [
      {
        "content": "This definition (as opposed to the one in ISO 19162:2015) is required for this document  because the concept is used in other definitions, such as first geodetic problem and second geodetic problem. The two definitions are nearly equivalent because the tangent of a curve on a surface is a tangent to the surface and does specify a direction. Usual 2D measure of bearing can be an angle equivalently measured from North clockwise, or a unit tangent vector. If the coordinate system is spatially 3D, the horizontal bearing angle may also need to a vertical altitude angle to be complete. If a reference curve (as used in ISO 19162) is parameterized by arc length, then the \"derivative\" is a unit vector. If another parameterization <math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mi>t</mi>  </mstyle></math> is used, then the derivative should be normalized (<math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mfrac>      <mover>        <mi>&#x3c4;</mi>        <mo>&#x2192;</mo>      </mover>      <mrow>        <mo>&#x2225;</mo>        <mover>          <mi>&#x3c4;</mi>          <mo>&#x2192;</mo>        </mover>        <mo>&#x2225;</mo>      </mrow>    </mfrac>    <mo>&#x3b;</mo>    <mover>      <mi>c</mi>      <mo>.</mo>    </mover>    <mrow>      <mo>(</mo>      <mi>t</mi>      <mo>)</mo>    </mrow>    <mo>=</mo>    <mover>      <mi>&#x3c4;</mi>      <mo>&#x2192;</mo>    </mover>    <mo>&#x3b;</mo>  </mstyle></math>). This is useful, since parameterization by arc length can be computationally difficult. The numeric representation of a vector depends on the coordinate system. The bearing is not dependent on a coordinate system, but it can be represented in any reasonable system. The bearing is not dependent on its various representations."
      }
    ],
    "release": 5.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2019",
          "clause": "3.4",
          "link": "https://www.iso.org/standard/66175.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "bearing"
      }
    ],
    "language_code": "eng",
    "entry_status": "valid",
    "review_date": "2019-12-02 00:00:00 +0500",
    "review_decision_date": "2019-12-02 00:00:00 +0500",
    "review_decision_event": "Normal ISO processing",
    "status": "valid"
  },
  "ara": null,
  "dan": null,
  "deu": null,
  "fin": null,
  "fra": null,
  "jpn": null,
  "kor": null,
  "msa": null,
  "nld": null,
  "pol": null,
  "rus": null,
  "spa": {
    "dates": [
      {
        "date": "2019-12-02 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "ángulo horizontal, tangente o dirección en un punto"
      }
    ],
    "examples": [

    ],
    "id": "2238",
    "notes": [
      {
        "content": "NOTA 1: Esta definición (a diferencia de la de la Norma ISO 19162:2015) es necesaria para este documento porque el concepto se utiliza en otras definiciones, como la del primer problema geodésico y la del segundo problema geodésico. Las dos definiciones son casi equivalentes porque la tangente de una curva en una superficie es una tangente a la superficie y especifica una dirección. La medida 2D habitual del rumbo puede ser un ángulo medido de forma equivalente desde el Norte en el sentido de las agujas del reloj, o una unidad de vector tangente. Si el sistema de coordenadas es tridimensional, el ángulo de rumbo horizontal puede necesitar también un ángulo de altitud vertical para ser completo. Si una curva de referencia (como la utilizada en la norma ISO 19162) se parametriza por la longitud del arco, entonces la \"derivada\" es un vector unitario. Si se utiliza otra parametrización \"t\", entonces la derivada debería ser normalizada (fórmula ). Esto es útil, ya que la parametrización por la longitud del arco puede ser difícil de calcular. La representación numérica de un vector depende del sistema de coordenadas. El rumbo no depende de un sistema de coordenadas, pero puede representarse en cualquier sistema razonable. El rumbo no depende de sus diversas representaciones."
      }
    ],
    "release": 5.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2019",
          "clause": "3.4",
          "link": "https://www.iso.org/standard/66175.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "rumbo"
      }
    ],
    "language_code": "spa",
    "entry_status": "valid",
    "review_date": "2019-12-02 00:00:00 +0500",
    "review_decision_date": "2019-12-02 00:00:00 +0500",
    "review_decision_event": "Procedimiento normal de ISO",
    "status": "valid"
  },
  "swe": null,
  "zho": null
}