{
  "term": "coordinate transformation",
  "termid": "2354",
  "eng": {
    "dates": [
      {
        "date": "2019-01-31 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "coordinate operation that changes coordinates in a source coordinate reference system to coordinates in a target coordinate reference system in which the source and target coordinate reference systems are based on different datums"
      }
    ],
    "examples": [

    ],
    "id": "2354",
    "notes": [
      {
        "content": "A coordinate transformation uses parameters which are derived empirically. Any error in those coordinates will be embedded in the coordinate transformation and when the coordinate transformation is applied the embedded errors are transmitted to output coordinates."
      },
      {
        "content": "A coordinate transformation is colloquially sometimes referred to as a 'datum transformation'. This is erroneous. A coordinate transformation changes coordinate values. It does not change the definition of the datum. In this document coordinates are referenced to a coordinate reference system. A coordinate transformation operates between two coordinate reference systems, not between two datums."
      }
    ],
    "release": 5.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19111:2019",
          "clause": "3.1.12",
          "link": "https://www.iso.org/standard/74039.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "coordinate transformation"
      }
    ],
    "language_code": "eng",
    "entry_status": "valid",
    "review_date": "2019-01-31 00:00:00 +0500",
    "review_decision_date": "2019-01-31 00:00:00 +0500",
    "review_decision_event": "Publication of document ISO 19111:2019(E)",
    "status": "valid"
  },
  "ara": null,
  "dan": null,
  "deu": null,
  "fin": null,
  "fra": null,
  "jpn": null,
  "kor": null,
  "msa": null,
  "nld": null,
  "pol": null,
  "rus": null,
  "spa": {
    "dates": [
      {
        "date": "2019-01-31 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "operación de coordenadas que cambia las coordenadas en un sistema de referencia por coordenadas origen a las coordenadas en un sistema de referencia por coordenadas destino en la que los sistemas de referencia de coordenadas se fundamentan en diferentes datums"
      }
    ],
    "examples": [

    ],
    "id": "2354",
    "notes": [
      {
        "content": "NOTA 1 Una transformación de coordenadas usa parámetros obtenidos empíricamente. Cualquier error en esas coordenadas se incorporará a la trasformación de coordenadas y cuando se aplique la trasformación los errores incorporados se trasmitirán a las coordenadas de salida."
      },
      {
        "content": "NOTA 2 Una trasformación de coordenadas a veces se denomina coloquialmente ‘trasformación de datum’. Eso es erróneo. Una trasformación de coordenadas cambia los valores de las coordenadas. No cambia la definición del datum. En este documento las coordenadas se refieren a un sistema de referencia por coordenadas. Una trasformación de coordenadas opera entre dos sistemas de referencia de coordenadas, no entre dos datums."
      }
    ],
    "release": 5.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19111:2019",
          "clause": "3.1.12",
          "link": "https://www.iso.org/standard/74039.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "transformación de coordenadas"
      }
    ],
    "language_code": "spa",
    "entry_status": "valid",
    "review_date": "2019-01-31 00:00:00 +0500",
    "review_decision_date": "2019-01-31 00:00:00 +0500",
    "review_decision_event": "Publicación de documento ISO 19111:2019(E)",
    "status": "valid"
  },
  "swe": null,
  "zho": null
}