{
  "term": "ellipsoid <geodesy>",
  "termid": "2382",
  "eng": {
    "dates": [
      {
        "date": "2019-12-02 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "geometric reference surface embedded in 3D Euclidean space represented by an ellipsoid of revolution where the rotation is about the polar axis"
      }
    ],
    "examples": [

    ],
    "id": "2382",
    "notes": [
      {
        "content": "For the Earth the rotation is about the polar axis. This results in an oblate ellipsoid with midpoint of the foci located at the nominal centre of the Earth."
      },
      {
        "content": "The two usual algorithms for latitude on an ellipsoid and on a sphere (such as used in spherical coordinates) are only equivalent if the ellipsoid is a sphere, having all radii equal in all directions. The problem is that a radial line from the centre of a general ellipsoid does not always cross the surface of the ellipsoid orthogonally. In general, planar slices through the centre do not intersect the surface orthogonally, and therefore the curves that correspond to the great circles of a sphere are not geodesics on the ellipsoid."
      },
      {
        "content": "The topology of the ellipsoid is inherited from the 𝔼3 space in which it is embedded. The difference is that metrics such as distance and direction on the ellipsoid are restricted to curves wholly on the surface and vectors tangent to the surface.at"
      }
    ],
    "release": 5.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2019",
          "clause": "3.31",
          "link": "https://www.iso.org/standard/66175.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "ellipsoid <geodesy>"
      }
    ],
    "language_code": "eng",
    "entry_status": "valid",
    "review_date": "2019-12-02 00:00:00 +0500",
    "review_decision_date": "2019-12-02 00:00:00 +0500",
    "review_decision_event": "Normal ISO processing",
    "status": "valid"
  },
  "ara": null,
  "dan": null,
  "deu": null,
  "fin": null,
  "fra": null,
  "jpn": null,
  "kor": null,
  "msa": null,
  "nld": null,
  "pol": null,
  "rus": null,
  "spa": {
    "dates": [
      {
        "date": "2019-12-02 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "superficie de referencia geométrica integrada en el espacio euclidiano tridimensional representada por un elipsoide de revolución donde la rotación es sobre el eje polar"
      }
    ],
    "examples": [

    ],
    "id": "2382",
    "notes": [
      {
        "content": "NOTA 1: Para la Tierra la rotación es sobre el eje polar. Esto resulta en un elipsoide oblicuo con el punto medio de los foco situados en el centro nominal de la Tierra."
      },
      {
        "content": "NOTA 2: Los dos algoritmos habituales para la latitud en un elipsoide y en una esfera (como los que se utilizan en las coordenadas esféricas) son equivalentes sólo si el elipsoide es una esfera, teniendo todos los radios iguales en todas las direcciones. El problema es que una línea radial desde el centro de un elipsoide general no siempre atraviesa la superficie del elipsoide ortogonalmente. En general, los planos que atraviesan el centro no cruzan la superficie ortogonalmente, y por lo tanto las curvas que corresponden a los círculos máximos de una esfera no son geodésicas en el elipsoide."
      },
      {
        "content": "NOTA 3: La topología del elipsoide se hereda del espacio de  𝔼3 en el que está embebido. La diferencia es que las métricas como la distancia y la dirección en el elipsoide están restringidas a curvas completamente en la superficie y a vectores tangentes a la superficie"
      }
    ],
    "release": 5.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2019",
          "clause": "3.31",
          "link": "https://www.iso.org/standard/66175.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "elipsoide <geodesia>"
      }
    ],
    "language_code": "spa",
    "entry_status": "valid",
    "review_date": "2019-12-02 00:00:00 +0500",
    "review_decision_date": "2019-12-02 00:00:00 +0500",
    "review_decision_event": "Procedimiento normal de ISO",
    "status": "valid"
  },
  "swe": null,
  "zho": null
}