{
  "term": "product level <earth observation>",
  "termid": "2446",
  "eng": {
    "dates": [
      {
        "date": "2020-07-07 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "number indicating the degree of processing that has been performed on the observed data"
      }
    ],
    "examples": [

    ],
    "id": "2446",
    "notes": [
      {
        "content": "Product levels 0 through 4 indicate the degree of processing performed on the raw data to convert them into more useful parameters and formats. The Committee on Earth Observation Satellites (CEOS) defines product levels as follows: - Raw Data: Data in their original packets, as received from a satellite. - Level 0: Reconstructed unprocessed instrument data at full space time resolution with all available supplemental information to be used in subsequent processing (e.g. ephemeris, health and safety) appended. - Level 1: Unpacked, reformatted level 0 data, with all supplemental information to be used in subsequent processing appended. Optional radiometric and geometric correction applied to produce parameters in physical units. Data generally presented as full - Level 2: Retrieved environmental variables (e.g. ocean wave height, soil moisture, ice concentration) at the same resolution and location as the level 1 source data. - Level 3: Data or retrieved environmental variables which have been spatially and/or temporally re-sampled (i.e. derived from level 1 or 2 products). Such re-sampling may include averaging and compositing. - Level 4: Model output or results from analyses of lower level data (i.e. variables that are not directly measured by the instruments but are derived from these measurements)."
      },
      {
        "content": "The product levels defined here are derived from satellite remote sensing heritage. For the case of airborne and in situ observations, these do not necessarily apply, but may be used as appropriate for indicating the degree of processing performed on the observed data."
      },
      {
        "content": "Adapted from Reference [9]."
      }
    ],
    "release": 6.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19165-2:2020",
          "clause": "3.8",
          "link": "https://www.iso.org/standard/73810.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "product level <earth observation>"
      }
    ],
    "language_code": "eng",
    "entry_status": "valid",
    "review_date": "2020-07-07 00:00:00 +0500",
    "review_decision_date": "2020-07-07 00:00:00 +0500",
    "review_decision_event": "Normal ISO processing",
    "status": "valid"
  },
  "ara": null,
  "dan": null,
  "deu": null,
  "fin": null,
  "fra": null,
  "jpn": null,
  "kor": null,
  "msa": null,
  "nld": null,
  "pol": null,
  "rus": null,
  "spa": null,
  "swe": null,
  "zho": null
}