{
  "term": "repeatability",
  "termid": "2751",
  "eng": {
    "dates": [
      {
        "date": "2023-04-27 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "stability of the response of a remote sensing instrument over time"
      }
    ],
    "examples": [

    ],
    "id": "2751",
    "notes": [
      {
        "content": "Repeatability or stability of a measurement between adjacent samples or within a single integrated measurement interval is referred to as \"short-term\" repeatability. Short-term repeatability is quantified from measurement noise with a timescale of typically seconds to minutes."
      },
      {
        "content": "Repeatability or stability of response from a stable input between consecutive or succeeding integrated measurement intervals is referred to as \"medium-term\" repeatability. Medium-term repeatability is typically quantified via benchmark tests that are included as part of a measurement sequence. Medium-term repeatability sources may include on-board stimulator sources, vicarious ground sources and stellar references. The medium-term repeatability timescale is typically minutes to hours."
      },
      {
        "content": "Repeatability or stability between widely separated measurement intervals is referred to as \"long-term\" repeatability. Long-term repeatability is typically quantified via benchmark tests that periodically measure constant radiometric source(s) over the life of the sensor. Long-term repeatability sources may include on-board stimulator sources, vicarious ground sources and stellar references. The long-term repeatability timescale is typically hours to days, up to the lifetime of the sensor."
      },
      {
        "content": "This entry is adapted from Reference [12]."
      }
    ],
    "release": 6.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO/TS 19124-1:2023",
          "clause": "3.28",
          "link": "https://www.iso.org/standard/79352.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "repeatability"
      }
    ],
    "language_code": "eng",
    "entry_status": "valid",
    "review_date": "2023-04-27 00:00:00 +0500",
    "review_decision_date": "2023-04-27 00:00:00 +0500",
    "review_decision_event": "Normal ISO processing",
    "status": "valid"
  },
  "ara": null,
  "dan": null,
  "deu": null,
  "fin": null,
  "fra": null,
  "jpn": null,
  "kor": null,
  "msa": null,
  "nld": null,
  "pol": null,
  "rus": null,
  "spa": null,
  "swe": null,
  "zho": null
}