{
  "term": "topological dimension",
  "termid": "463",
  "eng": {
    "dates": [
      {
        "date": "2003-05-01 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "minimum number of free variables needed to distinguish nearby direct positions within a geometric object from one another"
      }
    ],
    "examples": [

    ],
    "id": "463",
    "notes": [
      {
        "content": "The free variables mentioned above can usually be thought of as a local coordinate system. In a 3D coordinate space, a plane can be written as <math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mi>P</mi>    <mrow>      <mo>(</mo>      <mi>u</mi>      <mo>,</mo>      <mi>v</mi>      <mo>)</mo>    </mrow>    <mo>=</mo>    <mi>A</mi>    <mo>+</mo>    <mi>u</mi>    <mi>X</mi>    <mo>+</mo>    <mi>v</mi>    <mi>Y</mi>  </mstyle></math>, where <math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mi>u</mi>  </mstyle></math> and <math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mi>v</mi>  </mstyle></math> are real numbers and <math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mi>A</mi>  </mstyle></math> is any point on the plane, and <math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mi>X</mi>  </mstyle></math> and <math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mi>Y</mi>  </mstyle></math> are two vectors tangent to the plane. Since the locations on the plane can be distinguished by <math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mi>u</mi>  </mstyle></math> and <math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mi>v</mi>  </mstyle></math> (here universally), the plane is 2D and <math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\">  <mstyle displaystyle=\"true\">    <mrow>      <mo>(</mo>      <mi>u</mi>      <mo>,</mo>      <mi>v</mi>      <mo>)</mo>    </mrow>  </mstyle></math> is a coordinate system for the points on the plane. On generic surfaces, this cannot, in general, be done universally. If we take a plane tangent to the surface, and project points on the surface onto this plane, we will normally get a local  isomorphism for small neighbourhoods of the point of tangency. This \"local coordinate\" system for the underlying surface is sufficient to establish the surface as a 2D topological object. Since this International Standard deals only with spatial coordinates, any 3D object can rely on coordinates to establish its topological dimension. In a 4D model (spatio-temporal), tangent spaces also play an important role in establishing topological dimension for objects up to 3D."
      }
    ],
    "release": 1.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2003",
          "link": "https://www.iso.org/standard/26012.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "topological dimension"
      }
    ],
    "language_code": "eng",
    "entry_status": "valid",
    "review_date": "2016-02-15 00:00:00 +0500",
    "status": "valid"
  },
  "ara": {
    "dates": [
      {
        "date": "2003-05-01 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "الحد الأدنى من المتغيرات الحرة اللازمة لتمييز المواقع المباشرة القريبة داخل كائن هندسي بعضها عن بعض"
      }
    ],
    "examples": [

    ],
    "id": "463",
    "notes": [
      {
        "content": "المتغيرات الثلاثة المشار إليها أعلاه ينظر إليها عادة كنظام إحداثيات محلي. في الحيز الإحداثي الثلاثي الأبعاد يمكن كتابة السطح المستوى كالآتي: ع(ش , ت) = أ + ش س + ت ص , حيث أن \"ش\" و \"ت\" هما رقمان حقيقيان, و أن \" أ \" تمثل أي نقطة على السطح المستوي في حين أن \"س\" و \"ص\" هما متجهان مُمَّاسان للسطح المستوي. وحيث أنه يمكن تمييز المواقع على السطح المستوي بواسطة  \"ش\" و \"ت\" (وذلك بشكل عام في هذا المقام) فإن السطح هو سطح ثنائي البعد في حين أن (ش , ت) يمثلان نظام إحداثيات للنقاط الواقعة على السطح المستوي. وبصفة عامة , لا يمكن أن يطبق هذا بنفس العمومية على الأسطح العامة. إذا أخذنا مماس السطح المستوي إلى السطح وأسقطنا نقاطاً قائمة على هذا السطح على ذلك السطح المستوي, فإن النتيجة المعتادة التي نحصل عليها في هذه الحالة هي تشاكل محلي لمناطق صغيرة مجاورة لنقطة التماس. هذا النظام \"الإحداثي المحلي\" للسطح الأساسي كاف لإثبات أن السطح هو عبارة عن كيان طوبولوجي ثنائي الأبعاد  . وحيث أن هذا المقياس الدولي يتعامل فقط مع الإحداثيات المكانية, فإن أي كيان ثلاثي الأبعاد يستطيع الاعتماد على الإحداثيات لترسيخ بعده الطوبولوجي. في حالة النموذج الرباعي الأبعاد (أي النموذج المكاني – الزماني), فإن الحيز المكاني للمماس يكون له أيضاً دور مهم في ترسيخ الأبعاد الطوبولوجية للكيانات بما فيها الأبعاد الثلاثية."
      }
    ],
    "release": 1.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2003",
          "link": "https://www.iso.org/standard/26012.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "بعد طوبولوجي"
      }
    ],
    "language_code": "ara",
    "entry_status": "valid",
    "review_date": "2016-02-15 00:00:00 +0500",
    "status": "valid"
  },
  "dan": null,
  "deu": null,
  "fin": {
    "dates": [
      {
        "date": "2003-05-01 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "vähimmäismäärä vapaita muuttujia, joka tarvitaan erottamaan geometrisen objektin sisällä olevat lähekkäiset pisteet toisistaan"
      }
    ],
    "examples": [

    ],
    "id": "463",
    "notes": [
      {
        "content": "Määritelmässä mainittuja vapaita muuttujia voidaan tavallisesti ajatella paikallisena koordinaatistona. Kolmiulotteisessa koordinaattiavaruudessa taso  voidaan kirjoittaa yhtälönä P(u, v) = A + u X + v Y, missä u ja v ovat reaalilukuja, A on mikä hyvänsä tason piste ja X ja Y ovat kaksi tasoa tangenttivektoria. Koska sijainnit tasolla voidaan erottaa u:n ja v:n avulla (tässä universaalisti), taso on kaksiulotteinen ja (u, v) on koordinaatisto tasolla sijaitseville pisteille. Yleisillä pinnoilla tätä ei yleensä voida tehdä universaalisti. Jos otetaan pinnan tangenttitaso ja projisioidaan pinnalla olevia pisteitä tälle tasolle, syntyy normaalisti tangenttipisteen lähiympäristössä paikallinen isomorfismi. Tämä alla olevan pinnan \"paikallinen koordinaatisto\" riittää määrittelemään pinnan kaksiulotteiseksi topologiseksi objektiksi. Koska tässä kansainvälisessä standardissa käsitellään ainoastaan spatiaalisia koordinaatteja, minkä hyvänsä kolmiulotteisen objektin topologisen ulottuvuuden määrittely voidaan perustaa koordinaatteihin. Neliulotteisessa (spatiotemporaalisessa) mallissa tangenttiavaruudet ovat myös tärkeässä asemassa enintään kolmiulotteisten objektien topologisen dimension määrittelyssä."
      }
    ],
    "release": 1.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2003",
          "link": "https://www.iso.org/standard/26012.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "topologinen ulottuvuus"
      }
    ],
    "language_code": "fin",
    "entry_status": "valid",
    "review_date": "2016-02-15 00:00:00 +0500",
    "status": "valid"
  },
  "fra": {
    "dates": [
      {
        "date": "2003-05-01 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "nombre minimal de variables libres nécessaires pour distinguer les positions directes voisines d'un objet géométrique les unes des autres"
      }
    ],
    "examples": [

    ],
    "id": "463",
    "notes": [

    ],
    "release": 1.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2003",
          "link": "https://www.iso.org/standard/26012.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "dimension topologique"
      }
    ],
    "language_code": "fra",
    "entry_status": "valid",
    "review_date": "2016-02-15 00:00:00 +0500",
    "status": "valid"
  },
  "jpn": {
    "dates": [
      {
        "date": "2003-05-01 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "幾何オブジェクト内の直接位置を他の位置と区別するのに必要な自由変数の最小の数。"
      }
    ],
    "examples": [

    ],
    "id": "463",
    "notes": [
      {
        "content": "　上の自由変数は，多くの場合局地座標系として考えることができる。三次元座標空間において，uとvとを実数，Aを平面上の任意の点，X及びYを平面の二つの接ベクトルとすると，平面はP(u，v) = A + u X + v Yと書き表すことができる。この平面の位置はuとvとによって（ここでは至る所を）識別できるので，平面は二次元であり，(u，v)はこの平面上の点の座標となる。一般の曲面では，通常は，至る所を普遍的に識別するのは不可能である。曲面上の点を曲面の接平面上へ射影すると，接点の微小近傍の局所同形を通常得ることができる。曲面に対するこの“局所座標”系は，曲面が二次元位相オブジェクトであるための要件を満たす。\n 　この規格は空間座標だけを取り扱うので，任意の三次元オブジェクトは座標に依存してその位相次元を定めることができる。四次元モデル（時空間）では，接空間が三次元までのオブジェクトの位相次元を定めるという重要な役割も果たす。"
      }
    ],
    "release": 1.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2003",
          "link": "https://www.iso.org/standard/26012.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "位相次元"
      }
    ],
    "language_code": "jpn",
    "entry_status": "valid",
    "review_date": "2016-02-15 00:00:00 +0500",
    "status": "valid"
  },
  "kor": {
    "dates": [
      {
        "date": "2003-05-01 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "기하 객체 내에서 가까운 직접 위치들을 구분하기 위하여 필요한 자유변수의 최소수"
      }
    ],
    "examples": [

    ],
    "id": "463",
    "notes": [
      {
        "content": "자유 변수는 일반적으로 지역 좌표계로 여겨질 수 있다. 3차원 좌표공간에서 평면은 P(u,v)=A+uX+vY로 표시될 수 있다. 여기에서 u와 v는 실수이고, A는 평면상의 점이다. X와 Y는 평면에 접하는 두 벡터이다. 평면상의 위치는 u 및 v에 의해 구분할 수 있기 때문에, 평면은 2차원이고, (u,v)는 평면상의 점에 대한 좌표 체계이다. 일반적으로 일반 표면에 대해서는 이와 같이 보편화할 수 없다. 만일 면에 접하는 평면을 취하고, 면 위의 점들을 이 평면에 투영한다면, 명목상 접촉점의 작은 인접군에 대한 지역적 동형을 얻게 된다. 기초 표면에 대한 이 지역 좌표계는 표면을 2차원 위상 객체로 확립하기에 충분하다. KS X ISO 19107 표준은 공간 좌표만을 다루기 때문에, 어떤 3차원 객체도 위상 차원을 만드는 좌표에 사용될 수 있다. 마찬가지로, 4차원 모델(시공간적인)에서 객체 위상 차원을 3차원으로 확립하는 데 있어 접촉 공간이 중요한 역할을 한다."
      }
    ],
    "release": 1.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2003",
          "link": "https://www.iso.org/standard/26012.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "위상 차원"
      }
    ],
    "language_code": "kor",
    "entry_status": "valid",
    "review_date": "2016-02-15 00:00:00 +0500",
    "status": "valid"
  },
  "msa": null,
  "nld": null,
  "pol": {
    "dates": [
      {
        "date": "2003-05-01 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "najmniejsza liczba wolnyc zmiennych potrzebna do odróżnienia od siebie pobliskich położeń bezpośrednich w obiekcie geometrycznym"
      }
    ],
    "examples": [

    ],
    "id": "463",
    "notes": [
      {
        "content": "Wspomniane wyżej wolne zmienne na ogół mogą być traktowane jako lokalny układ współrzędnych.\nW 3-wymiarowej przestrzeni współrzędnych płaszczyzna może być zapisana jako P(u, v) = A + uX + vY, gdzie u i v są liczbami rzeczywistymi, A jest dowolnym punktem na płaszczyźnie, zaś X i Y są dwoma wektorami stycznymi do płaszczyzny. Ponieważ położenia na płaszczyźnie mogą być rozróżnione poprzez u i v (tutaj uniwersalnie), to płaszczyzna jest 2-wymiarowa,a (u, v) stanowi układ współrzędnych dla punktów na płaszczyźnie. Na powierzchniach ogólnych zwykle nie można tak zrobić w sposób uniwersalny. Jeżeli weźmiemy płaszczyznę styczną do powierzchni i zrzutujemy punkty tej powierzchni na tę płaszczyznę, na ogół otrzymamy lokalny izomorfizm dla niewielkich otoczeń punktów styczności. Ten „lokalny układ współrzędnych” dla powierzchni jest wystarczający, aby uznać tę powierzchnię za 2-wymiarowy obiekt topologiczny.\nPonieważ niniejsza Norma Międzynarodowa dotyczy jedynie współrzędnych przestrzennych, to do ustalenia wymiaru topologicznego dowolnego obiektu 3-wymiarowego można opierać się na współrzędnych. W modelu 4-wymiarowym (czasoprzestrzennym), również przestrzenie styczne odgrywają ważną rolę w ustalaniu wymiaru topologicznego dla obiektów aż do trzech wymiarów."
      }
    ],
    "release": 1.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2003",
          "link": "https://www.iso.org/standard/26012.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "wymiar topologiczny"
      }
    ],
    "language_code": "pol",
    "review_date": "2016-02-15 00:00:00 +0500"
  },
  "rus": {
    "dates": [
      {
        "date": "2003-05-01 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "минимальное число независимых переменных, нужное, чтобы различить близлежащие позиции геометрического объекта"
      }
    ],
    "examples": [

    ],
    "id": "463",
    "notes": [
      {
        "content": "Упомянутые независимые переменные можно в большинстве случаев рассматривать как локальную координатную систему. В трехмерном координатном пространстве плоскость может быть описана как P(u, v) = A + u X + v Y, где u и v – действительные числа,  A – любая точка на плоскости, а  X и Y – два вектора, касательные к плоскости. Поскольку положения на плоскости могут быть определены величинами u и v (здесь в общем виде), плоскость является двумерной и (u, v) – это координатная система для точек плоскости. Для поверхностей же в общем случае невозможно получить такую универсальную систему. Если взять плоскость, касательную к поверхности, и спроецировать точки данной поверхности на эту плоскость, можно получить лишь локальный изоморфизм для небольшой окрестности около точки касания. Эта «локальная координатная система» для лежащей в ее основе поверхности достаточна для представления поверхности как двумерного топологического объекта. Поскольку  ISO 19107 регламентирует  положения, связанные только  с пространственными координатами, любой трехмерный объект может опираться на координаты для установления его топологической размерности."
      }
    ],
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2003",
          "link": "https://www.iso.org/standard/26012.html"
        },
        "type": "authoritative",
        "status": "unspecified"
      },
      {
        "origin": {
          "ref": "Internet"
        },
        "type": "lineage"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "топологическая размерность"
      }
    ],
    "language_code": "rus",
    "entry_status": "valid",
    "status": "valid"
  },
  "spa": {
    "dates": [
      {
        "date": "2003-05-01 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "número mínimo de variables libres necesarias para distinguir posiciones directas próximas dentro de un objeto geométrico"
      }
    ],
    "examples": [

    ],
    "id": "463",
    "notes": [
      {
        "content": "NOTA Las tres variables libres mencionadas arriba, se pueden considerar normalmente como un sistema de coordenadas local. En un espacio tridimensional, un plano se puede escribir como P(u, v) = A + u X + v Y, donde u y v son números reales, A es cualquier punto del plano, y X e Y son dos vectores tangentes al plano. Desde el momento en que las localizaciones en el plano se pueden distinguir (universalmente) por u y v, el plano es bidimensional y (u,v) es un sistema de coordenadas para los puntos del plano. En superficies genéricas, por lo general, esto no puede hacerse universalmente. Si tomamos un plano tangente a la superficie, y proyectamos puntos de la superficie en este plano, normalmente tendremos un isoformismo local en la vecindad de los puntos de tangencia. Este sistema de \"coordenadas local\" para la superficie subyacente, es suficiente para establecer la superficie como un objeto topológico bidimensional. Como esta norma internacional sólo se ocupa de coordenadas espaciales, cualquier objeto tridimensional puede depender de las coordedadas para establecer su dimensión topológica. En un modelo de 4 dimensiones (espacio-temporal), los espacios tangentes también juegan un papel importante en el establecimiento de la dimensión topológica de los objetos hasta 3 dimensiones."
      }
    ],
    "release": 1.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2003",
          "link": "https://www.iso.org/standard/26012.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "dimensión topológica"
      }
    ],
    "language_code": "spa",
    "entry_status": "valid",
    "review_date": "2016-02-15 00:00:00 +0500",
    "status": "valid"
  },
  "swe": {
    "dates": [
      {
        "date": "2003-05-01 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "minsta antalet oberoende värden som krävs för att skilja närliggande positioner inom ett geometriskt objekt från varandra"
      }
    ],
    "examples": [

    ],
    "id": "463",
    "notes": [
      {
        "content": "The free variables mentioned above can usually be thought of as a local coordinate system. In a 3D coordinate space, a plane can be written as P(u, v) = A + u X + v Y, where u and v are real numbers and A is any point on the plane, and X and Y are two vectors tangent to the plane. Since the locations on the plane can be distinguished by u and v (here universally), the plane is 2D and (u, v) is a coordinate system for the points on the plane. On generic surfaces, this cannot, in general, be done universally. If we take a plane tangent to the surface, and project points on the surface onto this plane, we will normally get a local  isomorphism for small neighbourhoods of the point of tangency. This \"local coordinate\" system for the underlying surface is sufficient to establish the surface as a 2D topological object. Since this International Standard deals only with spatial coordinates, any 3D object can rely on coordinates to establish its topological dimension. In a 4D model (spatio-temporal), tangent spaces also play an important role in establishing topological dimension for objects up to 3D."
      }
    ],
    "release": 1.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2003",
          "link": "https://www.iso.org/standard/26012.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "topologisk dimension"
      }
    ],
    "language_code": "swe",
    "entry_status": "valid",
    "review_date": "2016-02-15 00:00:00 +0500",
    "status": "valid"
  },
  "zho": {
    "dates": [
      {
        "date": "2003-05-01 00:00:00 +0500",
        "type": "accepted"
      }
    ],
    "definition": [
      {
        "content": "在几何对象内区分邻近但不同的直接位置所需要的自由变量的最小个数。"
      }
    ],
    "examples": [

    ],
    "id": "463",
    "notes": [
      {
        "content": "上面提到的自由变量通常可以认为是一个局部坐标系。在三维坐标空间中，平面可以写为P(u,v)=A+uX+vY,这里u和v是实数，并且A是平面上的任意点，X和Y是两个矢量对于平面的正切。平面的位置可以用u,v（这里是普通的）来区分，平面是二维，并且（u,v)是平面上一个坐标系下的点。在曲面上，通常这不是总能被满足。如果我们取这个曲面的切平面，并且将曲面上的点投影到这个切平面上，我们将通常得到这个切点的一个小的邻域内的一个局部同构。对于与切平面上小邻域所对应的局部同构的曲面部分，这个“局部坐标”系足以作为二维拓扑对象建立这个曲面。由于本标准仅涉及空间坐标，任何三维对象可以依靠坐标建立它的拓扑维。 在一个四维模型（空间-时间）中，切空间在由对象在三维上建立拓扑维的过程中也起着重要的作用。"
      }
    ],
    "release": 1.0,
    "sources": [
      {
        "origin": {
          "ref": "ISO 19107:2003",
          "link": "https://www.iso.org/standard/26012.html"
        },
        "type": "authoritative"
      }
    ],
    "terms": [
      {
        "type": "expression",
        "normative_status": "preferred",
        "designation": "拓扑维"
      }
    ],
    "language_code": "zho",
    "entry_status": "valid",
    "review_date": "2016-02-15 00:00:00 +0500",
    "status": "valid"
  }
}